Repository: rmraya/XLIFFManager
Catalog: XliffManager_docs.tmx
Source language: en
Languages: es

source: Use this method to generate a fake translation that you can use to test the Merge XLIFF File process. After making sure that Merge runs successfully, you can use the Remove all Targets option to clean your XLIFF file.
es: Utilice este método para generar una traducción falsa que puede utilizar para probar el proceso Combinar XLIFF . Después de asegurarse de que la combinación se ejecuta correctamente, puede usar la opción Eliminar Todas las Traducciones para limpiar el archivo XLIFF.

source: Click the Pseudo-Translate button.
es: Haga clic en el botón Pseudo-Traducir .

source: Use this feature to remove all <target> elements from your XLIFF file.
es: Utilice esta función para eliminar todos los elementos <target> del archivo XLIFF.

source: Click the Remove all Targets button.
es: Haga clic en el botón Eliminar Todas las Traducciones .

source: Validate XLIFF
es: Validar XLIFF

source: XLIFF Manager can validate XLIFF 1.0, 1.1, 1.2 and 2.0.
es: XLIFF Manager puede validar XLIFF 1.0, 1.1, 1.2 y 2.0.

source: Validating XLIFF against XML grammars (DTD or XML Schemas) is not enough. XML Schema validation does not detect the use of duplicated 'id' attributes, wrong language codes and other constraints written in the different XLIFF specifications.
es: Validar XLIFF con gramáticas XML (DTD o esquemas XML) no es suficiente. La validación usando esquema XML no detecta el uso de atributos 'id' duplicados, códigos de idioma incorrectos y otras restricciones escritas en las diferentes especificaciones XLIFF.

source: In addition to validating all XLIFF 2.0 modules using XML Schema validation, extra validation is performed for XLIFF 2.0 Core and for Metadata, Matches and Glossary modules.
es: Además de validar todos los módulos XLIFF 2.0 mediante la validación de esquemas XML, se realiza una validación adicional para XLIFF 2.0 Core y para los módulos Metadata, Matches y Glossary.

source: Validate XLIFF File
es: Validar Archivo XLIFF

source: On the left panel, click on the Validate XLIFF option.
es: En el panel izquierdo, haga clic en la opción Validar XLIFF .

source: Type the name and location of the XLIFF file to validate in the XLIFF File text box or click the Browse... button to select an XLIFF file from the file system.
es: Escriba el nombre y la ubicación del archivo XLIFF que desea validar en el cuadro de texto Archivo XLIFF o haga clic en el botón Examinar... para seleccionar un archivo XLIFF del sistema de archivos.

source: Click the Validate XLIFF button.
es: Haga clic en el botón Validar XLIFF .

source: XLIFF Manager validates the indicated file.
es: XLIFF Manager valida el archivo indicado.

source: XLIFF Manager User Guide Copyright © 2018-2023 Maxprograms
es: Guía del Usuario de XLIFF Manager Derechos de autor © 2018-2023 Maxprograms

source: Creating and Merging XLIFF Files
es: Crear y Combinar Archivos XLIFF
